STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235fxx_ca35.h
/*
 * @brief DDRDBG block description (DDRDBG)
 */
typedef struct
{
  __IO uint32_t LP_DISABLE;                       /*!< DDRDBG low-power disable register                 Address offset: 0x000  */
  __IO uint32_t BYPASS_PCLKEN;                    /*!< DDRDBG bypass PCLKEN register                     Address offset: 0x004  */
  __IO uint32_t DDRC_AUTO_SR_DELAY;               /*!< DDRDBG DDRC auto SR delay register                Address offset: 0x008  */
  __IO uint32_t OBSP_CTRL;                        /*!< DDRDBG OBSP control register                      Address offset: 0x00C  */
  __IO uint32_t FRAC_PLL_LOCK;                    /*!< DDRDBG FRAC PLL lock register                     Address offset: 0x010  */
  __IO uint32_t DTO_OUTPUT;                       /*!< DDRDBG DTO output register                        Address offset: 0x014  */
       uint32_t RESERVED0[6];                     /*!< Reserved                                          Address offset: 0x018-0x02C */
  __IO uint32_t DFI_ERRORS_CTRL;                  /*!< DDRDBG DFI error control register                 Address offset: 0x030  */
  __IO uint32_t DFI_ERROR_STATUS;                 /*!< DDRDBG DFI error status register                  Address offset: 0x034  */
  __IO uint32_t DFI_ERROR_MSK;                    /*!< DDRDBG DFI error mask register                    Address offset: 0x038  */
       uint32_t RESERVED1[49];                    /*!< Reserved                                          Address offset: 0x03C-0x0FC */
  __IO uint32_t DDR34_AC_SWIZZLE_ADD3_0;          /*!< DDRDBG DDR34 AC swizzle ADD3_0 register           Address offset: 0x100  */
  __IO uint32_t DDR34_AC_SWIZZLE_ADD7_4;          /*!< DDRDBG DDR34 AC swizzle ADD7_4 register           Address offset: 0x104  */
  __IO uint32_t DDR34_AC_SWIZZLE_ADD11_8;         /*!< DDRDBG DDR34 AC swizzle ADD11_8 register          Address offset: 0x108  */
  __IO uint32_t DDR34_AC_SWIZZLE_ADD15_12;        /*!< DDRDBG DDR34 AC swizzle ADD15_12 register         Address offset: 0x10C  */
  __IO uint32_t DDR34_AC_SWIZZLE_BK2_0_ACTN;      /*!< DDRDBG DDR34 AC swizzle BK2 0 ACTN register       Address offset: 0x110  */
  __IO uint32_t DDR34_AC_SWIZZLE_RASN_CASN_BG1_0; /*!< DDRDBG DDR34 AC swizzle RASN CASN BG1_0 register  Address offset: 0x114  */
  __IO uint32_t DDR34_AC_SWIZZLE_WEN;             /*!< DDRDBG DDR34 AC swizzle WEN register              Address offset: 0x118  */
} DDRDBG_TypeDef;

/*
 * @brief DDRPERFM unit (DDRPERFM)
 */
typedef struct
{
  __IO uint32_t CTRL;         /*!< Control Register                    Address offset: 0x000 */
  __IO uint32_t IMSK;         /*!< Interrupt Mask Register             Address offset: 0x004 */
  __IO uint32_t ICLR;         /*!< Interrupt Clear Register            Address offset: 0x008 */
  __IO uint32_t CLR;          /*!< Interrupt Counter Clear Register    Address offset: 0x00C */
  __IO uint32_t CFG0;         /*!< Configuration Register 0            Address offset: 0x010 */
  __IO uint32_t CFG1;         /*!< Configuration Register 1            Address offset: 0x014 */
  __IO uint32_t CFG2;         /*!< Configuration Register 2            Address offset: 0x018 */
  __IO uint32_t CFG3;         /*!< Configuration Register 3            Address offset: 0x01C */
  __IO uint32_t CFG4;         /*!< Configuration Register 4            Address offset: 0x020 */
  __IO uint32_t CFG5;         /*!< Event Counter Enable Register       Address offset: 0x024 */
  __IO uint32_t DRAMINF;      /*!< DRAM Information Register           Address offset: 0x028 */
       uint32_t RESERVED0[5]; /*!< Reserved                            Address offset: 0x02C-0x03C */
  __IO uint32_t EVCNT0;       /*!< Event Counter 0 Register            Address offset: 0x040 */
  __IO uint32_t EVCNT1;       /*!< Event Counter 1 Register            Address offset: 0x044 */
  __IO uint32_t EVCNT2;       /*!< Event Counter 2 Register            Address offset: 0x048 */
  __IO uint32_t EVCNT3;       /*!< Event Counter 3 Register            Address offset: 0x04C */
  __IO uint32_t EVCNT4;       /*!< Event Counter 4 Register            Address offset: 0x050 */
  __IO uint32_t EVCNT5;       /*!< Event Counter 5 Register            Address offset: 0x054 */
  __IO uint32_t EVCNT6;       /*!< Event Counter 6 Register            Address offset: 0x058 */
  __IO uint32_t EVCNT7;       /*!< Event Counter 7 Register            Address offset: 0x05C */
  __IO uint32_t TCNT;         /*!< Time Counter Register               Address offset: 0x060 */
       uint32_t RESERVED1[7]; /*!< Reserved                            Address offset: 0x064-0x07C */
  __IO uint32_t STATUS;       /*!< Status Register                     Address offset: 0x080 */
} DDRPERFM_TypeDef;
/**
  * @brief DMA Controller
  */
/* c7amba_dma3_v1_0 */
typedef struct
{
  __IO uint32_t SECCFGR;          /*!< DMA secure configuration register,                      Address offset: 0x00  */
  __IO uint32_t PRIVCFGR;         /*!< DMA privileged configuration register,                  Address offset: 0x04  */
  __IO uint32_t RCFGLOCKR;        /*!< DMA configuration lock register                         Address offset: 0x08 */
  __IO uint32_t MISR;             /*!< DMA non secure masked interrupt status register,        Address offset: 0x0C  */
  __IO uint32_t SMISR;            /*!< DMA secure masked interrupt status register,            Address offset: 0x10  */
       uint32_t RESERVED[1003];   /*!< Reserved                                                Address offset: 0x014-0xFBC */
  __IO uint32_t HWCFGR13;         /*!< HPDMA hardware configuration 13 register                Address offset: 0xFC0 */
  __IO uint32_t HWCFGR12;         /*!< HPDMA hardware configuration 12 register                Address offset: 0xFC4 */
  __IO uint32_t HWCFGR11;         /*!< HPDMA hardware configuration 11 register                Address offset: 0xFC8 */
  __IO uint32_t HWCFGR10;         /*!< HPDMA hardware configuration 10 register                Address offset: 0xFCC */
  __IO uint32_t HWCFGR9;          /*!< HPDMA hardware configuration 9 register                 Address offset: 0xFD0 */
  __IO uint32_t HWCFGR8;          /*!< HPDMA hardware configuration 8 register                 Address offset: 0xFD4 */
  __IO uint32_t HWCFGR7;          /*!< HPDMA hardware configuration 7 register                 Address offset: 0xFD8 */
  __IO uint32_t HWCFGR6;          /*!< HPDMA hardware configuration 6 register                 Address offset: 0xFDC */
  __IO uint32_t HWCFGR5;          /*!< HPDMA hardware configuration 5 register                 Address offset: 0xFE0 */
  __IO uint32_t HWCFGR4;          /*!< HPDMA hardware configuration 4 register                 Address offset: 0xFE4 */
  __IO uint32_t HWCFGR3;          /*!< HPDMA hardware configuration 3 register                 Address offset: 0xFE8 */
  __IO uint32_t HWCFGR2;          /*!< HPDMA hardware configuration 2 register                 Address offset: 0xFEC */
  __IO uint32_t HWCFGR1;          /*!< HPDMA hardware configuration 1 register                 Address offset: 0xFF0 */
  __IO uint32_t VERR;             /*!< HPDMA version register                                  Address offset: 0xFF4 */
  __IO uint32_t IPIDR;            /*!< HPDMA identification register                           Address offset: 0xFF8 */
  __IO uint32_t SIDR;             /*!< HPDMA size identification register                      Address offset: 0xFFC */
} DMA_TypeDef;

typedef struct
{
  __IO uint32_t CLBAR;        /*!< DMA channel x linked-list base address register, Address offset: 0x50 + (x * 0x80) */
  __IO uint32_t CCIDCFGR;     /*!< DMA channel x CID register,                      Address offset: 0x54 + (x * 0x80) */
  __IO uint32_t CSEMCR;       /*!< DMA channel x semaphore control register,        Address offset: 0x58 + (x * 0x80) */
  __IO uint32_t CFCR;         /*!< DMA channel x flag clear register,               Address offset: 0x5C + (x * 0x80) */
  __IO uint32_t CSR;          /*!< DMA channel x flag status register,              Address offset: 0x60 + (x * 0x80) */
  __IO uint32_t CCR;          /*!< DMA channel x control register,                  Address offset: 0x64 + (x * 0x80) */
       uint32_t RESERVED2[10];/*!< Reserved 2,                                      Address offset: 0x68 -- 0x8C      */
  __IO uint32_t CTR1;         /*!< DMA channel x transfer register 1,               Address offset: 0x90 + (x * 0x80) */
  __IO uint32_t CTR2;         /*!< DMA channel x transfer register 2,               Address offset: 0x94 + (x * 0x80) */
  __IO uint32_t CBR1;         /*!< DMA channel x block register 1,                  Address offset: 0x98 + (x * 0x80) */
  __IO uint32_t CSAR;         /*!< DMA channel x source address register,           Address offset: 0x9C + (x * 0x80) */
  __IO uint32_t CDAR;         /*!< DMA channel x destination address register,      Address offset: 0xA0 + (x * 0x80) */
  __IO uint32_t CTR3;         /*!< DMA channel x transfer register 3,               Address offset: 0xA4 + (x * 0x80) */
  __IO uint32_t CBR2;         /*!< DMA channel x block register 2,                  Address offset: 0xA8 + (x * 0x80) */
       uint32_t RESERVED3[8]; /*!< Reserved 3,                                      Address offset: 0xAC -- 0xC8      */
  __IO uint32_t CLLR;         /*!< DMA channel x linked-list address register,      Address offset: 0xCC + (x * 0x80) */
} DMA_Channel_TypeDef;

/**
  * @brief DSI Controller
  */

typedef struct
{
  __IO uint32_t VR;               /*!< DSI Host version register                                 Address offset: 0x000 */
  __IO uint32_t CR;               /*!< DSI Host control register                                 Address offset: 0x004 */
  __IO uint32_t CCR;              /*!< DSI Host clock control register                           Address offset: 0x008 */
  __IO uint32_t LVCIDR;           /*!< DSI Host LTDC VCID register                               Address offset: 0x00C */
  __IO uint32_t LCOLCR;           /*!< DSI Host LTDC color coding register                       Address offset: 0x010 */
  __IO uint32_t LPCR;             /*!< DSI Host LTDC polarity configuration register             Address offset: 0x014 */
  __IO uint32_t LPMCR;            /*!< DSI Host low-power mode configuration register            Address offset: 0x018 */
       uint32_t RESERVED0[4];     /*!< Reserved                                                  Address offset: 0x01C-0x028 */
  __IO uint32_t PCR;              /*!< DSI Host protocol configuration register                  Address offset: 0x02C */
  __IO uint32_t GVCIDR;           /*!< DSI Host generic VCID register                            Address offset: 0x030 */
  __IO uint32_t MCR;              /*!< DSI Host mode configuration register                      Address offset: 0x034 */
  __IO uint32_t VMCR;             /*!< DSI Host video mode configuration register                Address offset: 0x038 */
  __IO uint32_t VPCR;             /*!< DSI Host video packet configuration register              Address offset: 0x03C */
  __IO uint32_t VCCR;             /*!< DSI Host video chunks configuration register              Address offset: 0x040 */
  __IO uint32_t VNPCR;            /*!< DSI Host video null packet configuration register         Address offset: 0x044 */
  __IO uint32_t VHSACR;           /*!< DSI Host video HSA configuration register                 Address offset: 0x048 */
  __IO uint32_t VHBPCR;           /*!< DSI Host video HBP configuration register                 Address offset: 0x04C */
  __IO uint32_t VLCR;             /*!< DSI Host video line configuration register                Address offset: 0x050 */
  __IO uint32_t VVSACR;           /*!< DSI Host video VSA configuration register                 Address offset: 0x054 */
  __IO uint32_t VVBPCR;           /*!< DSI Host video VBP configuration register                 Address offset: 0x058 */
  __IO uint32_t VVFPCR;           /*!< DSI Host video VFP configuration register                 Address offset: 0x05C */
  __IO uint32_t VVACR;            /*!< DSI Host video VA configuration register                  Address offset: 0x060 */
  __IO uint32_t LCCR;             /*!< DSI Host LTDC command configuration register              Address offset: 0x064 */
  __IO uint32_t CMCR;             /*!< DSI Host command mode configuration register              Address offset: 0x068 */
  __IO uint32_t GHCR;             /*!< DSI Host generic header configuration register            Address offset: 0x06C */
  __IO uint32_t GPDR;             /*!< DSI Host generic payload data register                    Address offset: 0x070 */
  __IO uint32_t GPSR;             /*!< DSI Host generic packet status register                   Address offset: 0x074 */
  __IO uint32_t TCCR0;            /*!< DSI Host timeout counter configuration register 0         Address offset: 0x078 */
  __IO uint32_t TCCR1;            /*!< DSI Host timeout counter configuration register 1         Address offset: 0x07C */
  __IO uint32_t TCCR2;            /*!< DSI Host timeout counter configuration register 2         Address offset: 0x080 */
  __IO uint32_t TCCR3;            /*!< DSI Host timeout counter configuration register 3         Address offset: 0x084 */
  __IO uint32_t TCCR4;            /*!< DSI Host timeout counter configuration register 4         Address offset: 0x088 */
  __IO uint32_t TCCR5;            /*!< DSI Host timeout counter configuration register 5         Address offset: 0x08C */
  __IO uint32_t TDCR;             /*!< DSI Host 3D configuration register                        Address offset: 0x090 */
  __IO uint32_t CLCR;             /*!< DSI Host clock lane configuration register                Address offset: 0x094 */
  __IO uint32_t CLTCR;            /*!< DSI Host clock lane timer configuration register          Address offset: 0x098 */
  __IO uint32_t DLTCR;            /*!< DSI Host data lane timer configuration register           Address offset: 0x09C */
  __IO uint32_t PCTLR;            /*!< DSI Host PHY control register                             Address offset: 0x0A0 */
  __IO uint32_t PCONFR;           /*!< DSI Host PHY configuration register                       Address offset: 0x0A4 */
  __IO uint32_t PUCR;             /*!< DSI Host PHY ULPS control register                        Address offset: 0x0A8 */
  __IO uint32_t PTTCR;            /*!< DSI Host PHY TX triggers configuration register           Address offset: 0x0AC */
  __IO uint32_t PSR;              /*!< DSI Host PHY status register                              Address offset: 0x0B0 */
  __IO uint32_t PTCR0;            /*!< DSI Host PHY test control register 0                      Address offset: 0x0B4 */
  __IO uint32_t PTCR1;            /*!< DSI Host PHY test control register 1                      Address offset: 0x0B8 */
  __IO uint32_t ISR0;             /*!< DSI Host interrupt and status register 0                  Address offset: 0x0BC */
  __IO uint32_t ISR1;             /*!< DSI Host interrupt and status register 1                  Address offset: 0x0C0 */
  __IO uint32_t IER0;             /*!< DSI Host interrupt enable register 0                      Address offset: 0x0C4 */
  __IO uint32_t IER1;             /*!< DSI Host interrupt enable register 1                      Address offset: 0x0C8 */
  __IO uint32_t PCCR;             /*!< DSI Host PHY calibration control register                 Address offset: 0x0CC */
       uint32_t RESERVED1[2];     /*!< Reserved                                                  Address offset: 0x0D0-0x0D4 */
  __IO uint32_t FIR0;             /*!< DSI Host force interrupt register 0                       Address offset: 0x0D8 */
  __IO uint32_t FIR1;             /*!< DSI Host force interrupt register 1                       Address offset: 0x0DC */
       uint32_t RESERVED2[5];     /*!< Reserved                                                  Address offset: 0x0E0-0x0F0 */
  __IO uint32_t DLTRCR;           /*!< DSI Host data lane timer read configuration register      Address offset: 0x0F4 */
       uint32_t RESERVED3[2];     /*!< Reserved                                                  Address offset: 0x0F8-0x0FC */
  __IO uint32_t VSCR;             /*!< DSI Host video shadow control register                    Address offset: 0x100 */
       uint32_t RESERVED4[2];     /*!< Reserved                                                  Address offset: 0x104-0x108 */
  __IO uint32_t LCVCIDR;          /*!< DSI Host LTDC current VCID register                       Address offset: 0x10C */
  __IO uint32_t LCCCR;            /*!< DSI Host LTDC current color coding register               Address offset: 0x110 */
       uint32_t RESERVED5;        /*!< Reserved                                                  Address offset: 0x114 */
  __IO uint32_t LPMCCR;           /*!< DSI Host low-power mode current configuration register    Address offset: 0x118 */
       uint32_t RESERVED6[7];     /*!< Reserved                                                  Address offset: 0x11C-0x134 */
  __IO uint32_t VMCCR;            /*!< DSI Host video mode current configuration register        Address offset: 0x138 */
  __IO uint32_t VPCCR;            /*!< DSI Host video packet current configuration register      Address offset: 0x13C */
  __IO uint32_t VCCCR;            /*!< DSI Host video chunks current configuration register      Address offset: 0x140 */
  __IO uint32_t VNPCCR;           /*!< DSI Host video null packet current configuration register Address offset: 0x144 */
  __IO uint32_t VHSACCR;          /*!< DSI Host video HSA current configuration register         Address offset: 0x148 */
  __IO uint32_t VHBPCCR;          /*!< DSI Host video HBP current configuration register         Address offset: 0x14C */
  __IO uint32_t VLCCR;            /*!< DSI Host video line current configuration register        Address offset: 0x150 */
  __IO uint32_t VVSACCR;          /*!< DSI Host video VSA current configuration register         Address offset: 0x154 */
  __IO uint32_t VVBPCCR;          /*!< DSI Host video VBP current configuration register         Address offset: 0x158 */
  __IO uint32_t VVFPCCR;          /*!< DSI Host video VFP current configuration register         Address offset: 0x15C */
  __IO uint32_t VVACCR;           /*!< DSI Host video VA current configuration register          Address offset: 0x160 */
       uint32_t RESERVED7[11];    /*!< Reserved                                                  Address offset: 0x164-0x18C */
  __IO uint32_t TDCCR;            /*!< DSI Host 3D current configuration register                Address offset: 0x190 */
       uint32_t RESERVED8[155];   /*!< Reserved                                                  Address offset: 0x194-0x3FC */
  __IO uint32_t WCFGR;            /*!< DSI wrapper configuration register                        Address offset: 0x400 */
  __IO uint32_t WCR;              /*!< DSI wrapper control register                              Address offset: 0x404 */
  __IO uint32_t WIER;             /*!< DSI wrapper interrupt enable register                     Address offset: 0x408 */
  __IO uint32_t WISR;             /*!< DSI wrapper interrupt and status register                 Address offset: 0x40C */
  __IO uint32_t WIFCR;            /*!< DSI wrapper interrupt flag clear register                 Address offset: 0x410 */
       uint32_t RESERVED9;        /*!< Reserved                                                  Address offset: 0x414 */
  __IO uint32_t WPCR0;            /*!< DSI wrapper PHY configuration register 0                  Address offset: 0x418 */
       uint32_t RESERVED10[5];    /*!< Reserved                                                  Address offset: 0x41C-0x42C */
  __IO uint32_t WPCR1;            /*!< DSI wrapper PHY configuration register 1                  Address offset: 0x430 */
  __IO uint32_t WRPCR0;           /*!< DSI wrapper regulator and PLL configuration register 0    Address offset: 0x434 */
  __IO uint32_t WRPCR1;           /*!< DSI wrapper regulator and PLL configuration register 1    Address offset: 0x438 */
  __IO uint32_t WRPCR2;           /*!< DSI wrapper regulator and PLL configuration register 2    Address offset: 0x43C */
  __IO uint32_t WRPSR0;           /*!< DSI wrapper regulator and PLL status register 0           Address offset: 0x440 */
  __IO uint32_t WRPSR1;           /*!< DSI wrapper regulator and PLL status register 1           Address offset: 0x444 */
       uint32_t RESERVED11[14];   /*!< Reserved                                                  Address offset: 0x448-0x47C */
  __IO uint32_t WCRB;             /*!< DSI wrapper control register bis                          Address offset: 0x480 */
       uint32_t RESERVED12[219];  /*!< Reserved                                                  Address offset: 0x484-0x7EC */
  __IO uint32_t HWCFGR;           /*!< DSI Host hardware configuration register                  Address offset: 0x7F0 */
  __IO uint32_t VERR;             /*!< DSI Host version register                                 Address offset: 0x7F4 */
  __IO uint32_t IPIDR;            /*!< DSI Host identification register                          Address offset: 0x7F8 */
  __IO uint32_t SIDR;             /*!< DSI Host size identification register                     Address offset: 0x7FC */
} DSI_TypeDef;

