STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235fxx_ca35.h
/**
  * @brief RIMC Resource Isolation Master Controller (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t CR;            /*!< RIMC Configuration register,         Address offset: 0xC00 */
  __IO uint32_t SR;            /*!< RIMC Status register,                Address offset: 0xC04 */
       uint32_t RESERVED1[2];  /*!< Reserved,                                      0xC08-0xC0C */
  __IO uint32_t ATTR[16];      /*!< RIMC Attribute register x,                     0xC10-0xC4C */
} RIMC_TypeDef;

/**
  * @brief RIFSC Resource Isolation Framework Security Controller ID Registers (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t PPSR0;        /*!< RIFSC peripheral protection status register 0, Address offset: 0xFB0 */
  __IO uint32_t PPSR1;        /*!< RIFSC peripheral protection status register 1, Address offset: 0xFB4 */
  __IO uint32_t PPSR2;        /*!< RIFSC peripheral protection status register 2, Address offset: 0xFB8 */
  __IO uint32_t PPSR3;        /*!< RIFSC peripheral protection status register 3, Address offset: 0xFBC */
       uint32_t RESERVED[10]; /*!< Reserved,                               Address offsets: 0xFC0-0xFE4 */
  __IO uint32_t HWCFGR3;      /*!< RIFSC HW configuration register 3,             Address offset: 0xFE8 */
  __IO uint32_t HWCFGR2;      /*!< RIFSC HW configuration register 2,             Address offset: 0xFEC */
  __IO uint32_t HWCFGR1;      /*!< RIFSC HW configuration register 1,             Address offset: 0xFF0 */
  __IO uint32_t VERR;         /*!< RIFSC Version register,                        Address offset: 0xFF4 */
  __IO uint32_t IPIDR;        /*!< RIFSC Identification register,                 Address offset: 0xFF8 */
  __IO uint32_t SIDR;         /*!< RIFSC Size ID register,                        Address offset: 0xFFC */
} RIFSC_ID_TypeDef;

/**
  * @brief RISAB Resource Isolation Slave Unit for Address Space Protection (block-based) Page Compartment (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t PRIVCFGR;      /*!< RISAB Compartment privilege configuration register */
       uint32_t RESERVED1[1];  /*!< Reserved                                           */
  __IO uint32_t RDCFGR;        /*!< RISAB Compartment read configuration register      */
       uint32_t RESERVED2[1];  /*!< Reserved                                           */
  __IO uint32_t WRCFGR;        /*!< RISAB Compartment write configuration register     */
       uint32_t RESERVED3[3];  /*!< Reserved                                           */
} RISAB_PageComp_TypeDef;

/**
  * @brief RISAB Resource Isolation Slave Unit for Address Space Protection (block-based) (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t               CR;             /*!< RISAB Configuration register,                                      Address offset: 0x000 */
       uint32_t               RESERVED1[1];   /*!< Reserved,                                                                          0x004 */
  __IO uint32_t               IASR;           /*!< RISAB Illegal access status register,                              Address offset: 0x008 */
  __IO uint32_t               IACR;           /*!< RISAB Illegal access clear register,                               Address offset: 0x00C */
  __IO uint32_t               RIFLOCKR;       /*!< RISAB RIF configuration lock register,                             Address offset: 0x010 */
       uint32_t               RESERVED2[3];   /*!< Reserved,                                                                    0x014-0x01C */
  __IO uint32_t               IAESR;          /*!< RISAB Illegal access error status register,                        Address offset: 0x020 */
  __IO uint32_t               IADDR;          /*!< RISAB Illegal address register,                                    Address offset: 0x024 */
       uint32_t               RESERVED3[54];  /*!< Reserved,                                                                    0x028-0x0FC */
  __IO uint32_t               PGSECCFGR[32];  /*!< RISAB Page x Security configuration register,                                0x100-0x17C */
       uint32_t               RESERVED4[32];  /*!< Reserved,                                                                    0x180-0x1FC */
  __IO uint32_t               PGPRIVCFGR[32]; /*!< RISAB Page x Privileged configuration register,                              0x200-0x27C */
       uint32_t               RESERVED5[224]; /*!< Reserved,                                                                    0x280-0x5FC */
  __IO uint32_t               PGC2PRIVCFGR[32]; /*!< RISAB Page x privileged configuration register for compartment 2,          0x600-0x67C */
       uint32_t               RESERVED6[96];  /*!< Reserved,                                                                    0x680-0x7FC */
       RISAB_PageComp_TypeDef CID[7];         /*!< RISAB Compartment x privilege configuration register,                        0x800-0x8DC */
       uint32_t               RESERVED8[72];  /*!< Reserved,                                                                    0x8E0-0x9FC */
  __IO uint32_t               PGCIDCFGR[32];  /*!< RISAB Compartment configuration for page x,                                  0xA00-0xA7C */
       uint32_t               RESERVED9[346]; /*!< Reserved,                                                                    0xA80-0xFE4 */
  __IO uint32_t               HWCFGR3;        /*!< RISAB HW configuration register 3,                                 Address offset: 0xFE8 */
  __IO uint32_t               HWCFGR2;        /*!< RISAB HW configuration register 2,                                 Address offset: 0xFEC */
  __IO uint32_t               HWCFGR1;        /*!< RISAB HW configuration register 1,                                 Address offset: 0xFF0 */
  __IO uint32_t               VERR;           /*!< RISAB Version register,                                            Address offset: 0xFF4 */
  __IO uint32_t               IPIDR;          /*!< RISAB Identification register,                                     Address offset: 0xFF8 */
  __IO uint32_t               SIDR;           /*!< RISAB Size ID register,                                            Address offset: 0xFFC */
} RISAB_TypeDef;

/**
  * @brief RISAF Resource Isolation Slave Unit for Address Space Protection (full version) Region (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t CFGR;          /*!< RISAF Region x configuration register             */
  __IO uint32_t STARTR;        /*!< RISAF Region x start address register             */
  __IO uint32_t ENDR;          /*!< RISAF Region x end address register               */
  __IO uint32_t CIDCFGR;       /*!< RISAF Region x CID configuration register         */
  __IO uint32_t ACFGR;         /*!< RISAF Region x subregion A configuration register */
  __IO uint32_t ASTARTR;       /*!< RISAF Region x subregion A start address register */
  __IO uint32_t AENDR;         /*!< RISAF Region x subregion A end address register   */
  __IO uint32_t ANESTR;        /*!< RISAF Region x subregion A nested mode register   */
  __IO uint32_t BCFGR;         /*!< RISAF Region x subregion B configuration register */
  __IO uint32_t BSTARTR;       /*!< RISAF Region x subregion B start address register */
  __IO uint32_t BENDR;         /*!< RISAF Region x subregion B end address register   */
  __IO uint32_t BNESTR;        /*!< RISAF Region x subregion B nested mode register   */
       uint32_t RESERVED1[4];  /*!< Reserved                                          */
} RISAF_Region_TypeDef;

/**
  * @brief RISAF Resource Isolation Slave Unit for Address Space Protection (full version) Illegal Access Register (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t             IAESR;         /*!< RISAF Illegal access error status register */
  __IO uint32_t             IADDR;         /*!< RISAF Illegal address register,            */
} RISAF_Illegal_TypeDef;

/**
  * @brief RISAF Resource Isolation Slave Unit for Address Space Protection (full version) (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t              CR;             /*!< RISAF Configuration register,                                      Address offset: 0x000 */
  __IO uint32_t              SR;             /*!< RISAF Status register,                                             Address offset: 0x004 */
  __IO uint32_t              IASR;           /*!< RISAF Illegal access status register,                              Address offset: 0x008 */
  __IO uint32_t              IACR;           /*!< RISAF Illegal access clear register,                               Address offset: 0x00C */
       uint32_t              RESERVED0[4];   /*!< Reserved,                                                                    0x010-0x01C */
       RISAF_Illegal_TypeDef IAR[2];         /*!< RISAF Illegal access error status and address register,                      0x020-0x02C */
  __IO uint32_t              KEYR[4];        /*!< RISAF Encryption key register x,                                             0x030-0x03C */
       RISAF_Region_TypeDef  REG[15];        /*!< RISAF Region x configuration register,                                       0x040-0x3FC */
       uint32_t              RESERVED1[764]; /*!< Reserved,                                                                    0x400-0xFEC */
  __IO uint32_t              HWCFGR;         /*!< RISAF HW configuration register,                                   Address offset: 0xFF0 */
  __IO uint32_t              VERR;           /*!< RISAF Version register,                                            Address offset: 0xFF4 */
  __IO uint32_t              IPIDR;          /*!< RISAF Identification register,                                     Address offset: 0xFF8 */
  __IO uint32_t              SIDR;           /*!< RISAF Size ID register,                                            Address offset: 0xFFC */
} RISAF_TypeDef;

/**
  * @brief RIF Illegal Access Controller (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t IER[6];         /*!< IAC Interrupt enable register x,                                           0x000-0x014 */
       uint32_t RESERVED1[26];  /*!< Reserved,                                                                  0x018-0x07C */
  __IO uint32_t ISR[6];         /*!< IAC Interrupt status register x,                                           0x080-0x094 */
       uint32_t RESERVED2[26];  /*!< Reserved,                                                                  0x098-0x0FC */
  __IO uint32_t ICR[6];         /*!< IAC Interrupt clear register x,                                            0x100-0x114 */
       uint32_t RESERVED3[149]; /*!< Reserved,                                                                  0x118-0x368 */
  __IO uint32_t IISR[6];        /*!< IAC Ilac input status register x,                                          0x36C-0x380 */
       uint32_t RESERVED4[26];  /*!< Reserved,                                                                  0x384-0x3E8 */
  __IO uint32_t HWCFGR2;        /*!< IAC HW configuration register 2,                                 Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;        /*!< IAC HW configuration register 1,                                 Address offset: 0x3F0 */
  __IO uint32_t VERR;           /*!< IAC Version register,                                            Address offset: 0x3F4 */
  __IO uint32_t IPIDR;          /*!< IAC Identification register,                                     Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< IAC Size ID register,                                            Address offset: 0x3FC */
} IAC_TypeDef;

/**
  * @brief RNG
  */

typedef struct
{
  __IO uint32_t CR;             /*!< RNG control register,               Address offset: 0x00  */
  __IO uint32_t SR;             /*!< RNG status register,                Address offset: 0x04  */
  __IO uint32_t DR;             /*!< RNG data register,                  Address offset: 0x08  */
  __IO uint32_t NSCR;           /*!< RNG noise source control register   Address offset: 0x00C */
  __IO uint32_t HTCR;           /*!< RNG health test control register,   Address offset: 0x10  */
  __IO uint32_t RESERVED2[247]; /*!< Reserved                            0x14 - 0x3EC          */
  __IO uint32_t HWCFGR;         /*!< RNG hardware configuration register Address offset: 0x3F0 */
  __IO uint32_t VERR;           /*!< RNG version register                Address offset: 0x3F4 */
  __IO uint32_t IPIDR;          /*!< RNG identification register         Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< RNG size identification register    Address offset: 0x3FC */
} RNG_TypeDef;

