STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235fxx_ca35.h
/*******************  Bit definition for I3C_DCR register  ********************/
#define I3C_DCR_DCR_Pos              (0U)
#define I3C_DCR_DCR_Msk              (0xFFUL << I3C_DCR_DCR_Pos)            /*!< 0x000000FF */
#define I3C_DCR_DCR                  I3C_DCR_DCR_Msk                       /*!< device characteristics ID */

/*****************  Bit definition for I3C_GETCAPR register  ******************/
#define I3C_GETCAPR_CAPPEND_Pos      (14U)
#define I3C_GETCAPR_CAPPEND_Msk      (0x1UL << I3C_GETCAPR_CAPPEND_Pos)     /*!< 0x00004000 */
#define I3C_GETCAPR_CAPPEND          I3C_GETCAPR_CAPPEND_Msk               /*!< IBI MDB support for pending read notification */

/******************  Bit definition for I3C_CRCAPR register  ******************/
#define I3C_CRCAPR_CAPDHOFF_Pos      (3U)
#define I3C_CRCAPR_CAPDHOFF_Msk      (0x1UL << I3C_CRCAPR_CAPDHOFF_Pos)     /*!< 0x00000008 */
#define I3C_CRCAPR_CAPDHOFF          I3C_CRCAPR_CAPDHOFF_Msk               /*!< delayed controller-role hand-off */
#define I3C_CRCAPR_CAPGRP_Pos        (9U)
#define I3C_CRCAPR_CAPGRP_Msk        (0x1UL << I3C_CRCAPR_CAPGRP_Pos)       /*!< 0x00000200 */
#define I3C_CRCAPR_CAPGRP            I3C_CRCAPR_CAPGRP_Msk                 /*!< group management support (when acting as controller) */

/*****************  Bit definition for I3C_GETMXDSR register  *****************/
#define I3C_GETMXDSR_HOFFAS_Pos      (0U)
#define I3C_GETMXDSR_HOFFAS_Msk      (0x3UL << I3C_GETMXDSR_HOFFAS_Pos)     /*!< 0x00000003 */
#define I3C_GETMXDSR_HOFFAS          I3C_GETMXDSR_HOFFAS_Msk               /*!< controller hand-off activity state */
#define I3C_GETMXDSR_HOFFAS_0        (0x1UL << I3C_GETMXDSR_HOFFAS_Pos)    /*!< 0x00000001 */
#define I3C_GETMXDSR_HOFFAS_1        (0x2UL << I3C_GETMXDSR_HOFFAS_Pos)    /*!< 0x00000002 */
#define I3C_GETMXDSR_FMT_Pos         (8U)
#define I3C_GETMXDSR_FMT_Msk         (0x3UL << I3C_GETMXDSR_FMT_Pos)        /*!< 0x00000300 */
#define I3C_GETMXDSR_FMT             I3C_GETMXDSR_FMT_Msk                  /*!< GETMXDS CCC format */
#define I3C_GETMXDSR_FMT_0           (0x1UL << I3C_GETMXDSR_FMT_Pos)       /*!< 0x00000100 */
#define I3C_GETMXDSR_FMT_1           (0x2UL << I3C_GETMXDSR_FMT_Pos)       /*!< 0x00000200 */
#define I3C_GETMXDSR_RDTURN_Pos      (16U)
#define I3C_GETMXDSR_RDTURN_Msk      (0xFFUL << I3C_GETMXDSR_RDTURN_Pos)    /*!< 0x00FF0000 */
#define I3C_GETMXDSR_RDTURN          I3C_GETMXDSR_RDTURN_Msk               /*!< programmed byte of the 3-byte MaxRdTurn (maximum read turnaround byte) */
#define I3C_GETMXDSR_TSCO_Pos        (24U)
#define I3C_GETMXDSR_TSCO_Msk        (0x1UL << I3C_GETMXDSR_TSCO_Pos)       /*!< 0x01000000 */
#define I3C_GETMXDSR_TSCO            I3C_GETMXDSR_TSCO_Msk                 /*!< clock-to-data turnaround time (tSCO) */

/******************  Bit definition for I3C_EPIDR register  *******************/
#define I3C_EPIDR_MIPIID_Pos         (12U)
#define I3C_EPIDR_MIPIID_Msk         (0xFUL << I3C_EPIDR_MIPIID_Pos)        /*!< 0x0000F000 */
#define I3C_EPIDR_MIPIID             I3C_EPIDR_MIPIID_Msk                  /*!< 4-bit MIPI Instance ID */
#define I3C_EPIDR_IDTSEL_Pos         (16U)
#define I3C_EPIDR_IDTSEL_Msk         (0x1UL << I3C_EPIDR_IDTSEL_Pos)        /*!< 0x00010000 */
#define I3C_EPIDR_IDTSEL             I3C_EPIDR_IDTSEL_Msk                  /*!< provisioned ID type selector */
#define I3C_EPIDR_MIPIMID_Pos        (17U)
#define I3C_EPIDR_MIPIMID_Msk        (0x7FFFUL << I3C_EPIDR_MIPIMID_Pos)    /*!< 0xFFFE0000 */
#define I3C_EPIDR_MIPIMID            I3C_EPIDR_MIPIMID_Msk                 /*!< 15-bit MIPI manufacturer ID */

/******************  Bit definition for I3C_HWCFGR register  ******************/
#define I3C_HWCFGR_CSIZE_Pos         (0U)
#define I3C_HWCFGR_CSIZE_Msk         (0xFUL << I3C_HWCFGR_CSIZE_Pos)        /*!< 0x0000000F */
#define I3C_HWCFGR_CSIZE             I3C_HWCFGR_CSIZE_Msk                  /*!< C-FIFO size, in multiple of (32-bit) words */
#define I3C_HWCFGR_SSIZE_Pos         (4U)
#define I3C_HWCFGR_SSIZE_Msk         (0xFUL << I3C_HWCFGR_SSIZE_Pos)        /*!< 0x000000F0 */
#define I3C_HWCFGR_SSIZE             I3C_HWCFGR_SSIZE_Msk                  /*!< S-FIFO size, in multiple of (32-bit) words */
#define I3C_HWCFGR_TSIZE_Pos         (8U)
#define I3C_HWCFGR_TSIZE_Msk         (0xFUL << I3C_HWCFGR_TSIZE_Pos)        /*!< 0x00000F00 */
#define I3C_HWCFGR_TSIZE             I3C_HWCFGR_TSIZE_Msk                  /*!< TX-FIFO size, in multiple of 4 bytes */
#define I3C_HWCFGR_RSIZE_Pos         (12U)
#define I3C_HWCFGR_RSIZE_Msk         (0xFUL << I3C_HWCFGR_RSIZE_Pos)        /*!< 0x0000F000 */
#define I3C_HWCFGR_RSIZE             I3C_HWCFGR_RSIZE_Msk                  /*!< RX-FIFO size, in multiple of 4 bytes */
#define I3C_HWCFGR_NBT_Pos           (16U)
#define I3C_HWCFGR_NBT_Msk           (0xFUL << I3C_HWCFGR_NBT_Pos)          /*!< 0x000F0000 */
#define I3C_HWCFGR_NBT               I3C_HWCFGR_NBT_Msk                    /*!< number of targets whose the IBI/controller-role request can be managed in parallel by this I3C IP,  */

/*******************  Bit definition for I3C_VERR register  *******************/
#define I3C_VERR_MINREV_Pos          (0U)
#define I3C_VERR_MINREV_Msk          (0xFUL << I3C_VERR_MINREV_Pos)         /*!< 0x0000000F */
#define I3C_VERR_MINREV              I3C_VERR_MINREV_Msk                   /*!< minor IP revision */
#define I3C_VERR_MAJREV_Pos          (4U)
#define I3C_VERR_MAJREV_Msk          (0xFUL << I3C_VERR_MAJREV_Pos)         /*!< 0x000000F0 */
#define I3C_VERR_MAJREV              I3C_VERR_MAJREV_Msk                   /*!< major IP revision */

/******************  Bit definition for I3C_IPIDR register  *******************/
#define I3C_IPIDR_ID_Pos             (0U)
#define I3C_IPIDR_ID_Msk             (0xFFFFFFFFUL << I3C_IPIDR_ID_Pos)     /*!< 0xFFFFFFFF */
#define I3C_IPIDR_ID                 I3C_IPIDR_ID_Msk                      /*!< IP identification */

/*******************  Bit definition for I3C_SIDR register  *******************/
#define I3C_SIDR_SID_Pos             (0U)
#define I3C_SIDR_SID_Msk             (0xFFFFFFFFUL << I3C_SIDR_SID_Pos)     /*!< 0xFFFFFFFF */
#define I3C_SIDR_SID                 I3C_SIDR_SID_Msk                      /*!< IP address space size identification */

/******************************************************************************/
/*                                                                            */
/*              Inter-Processor Communication Controller (IPCC)               */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for IPCC_C1CR register  *******************/
#define IPCC_C1CR_RXOIE_Pos           (0U)
#define IPCC_C1CR_RXOIE_Msk           (0x1UL << IPCC_C1CR_RXOIE_Pos)           /*!< 0x00000001 */
#define IPCC_C1CR_RXOIE               IPCC_C1CR_RXOIE_Msk                     /*!< Processor 1 Receive channel occupied non-secure interrupt enable */
#define IPCC_C1CR_SECRXOIE_Pos        (1U)
#define IPCC_C1CR_SECRXOIE_Msk        (0x1UL << IPCC_C1CR_SECRXOIE_Pos)        /*!< 0x00000002 */
#define IPCC_C1CR_SECRXOIE            IPCC_C1CR_SECRXOIE_Msk                  /*!< Processor 1 Receive channel occupied secure interrupt enable */
#define IPCC_C1CR_TXFIE_Pos           (16U)
#define IPCC_C1CR_TXFIE_Msk           (0x1UL << IPCC_C1CR_TXFIE_Pos)           /*!< 0x00010000 */
#define IPCC_C1CR_TXFIE               IPCC_C1CR_TXFIE_Msk                     /*!< Processor 1Transmit channel free non-secure interrupt enable */
#define IPCC_C1CR_SECTXFIE_Pos        (17U)
#define IPCC_C1CR_SECTXFIE_Msk        (0x1UL << IPCC_C1CR_SECTXFIE_Pos)        /*!< 0x00020000 */
#define IPCC_C1CR_SECTXFIE            IPCC_C1CR_SECTXFIE_Msk                  /*!< Processor 1Transmit channel free secure interrupt enable */

/******************  Bit definition for IPCC_C1MR register  *******************/
#define IPCC_C1MR_CH1OM_Pos           (0U)
#define IPCC_C1MR_CH1OM_Msk           (0x1UL << IPCC_C1MR_CH1OM_Pos)           /*!< 0x00000001 */
#define IPCC_C1MR_CH1OM               IPCC_C1MR_CH1OM_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH2OM_Pos           (1U)
#define IPCC_C1MR_CH2OM_Msk           (0x1UL << IPCC_C1MR_CH2OM_Pos)           /*!< 0x00000002 */
#define IPCC_C1MR_CH2OM               IPCC_C1MR_CH2OM_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH3OM_Pos           (2U)
#define IPCC_C1MR_CH3OM_Msk           (0x1UL << IPCC_C1MR_CH3OM_Pos)           /*!< 0x00000004 */
#define IPCC_C1MR_CH3OM               IPCC_C1MR_CH3OM_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH4OM_Pos           (3U)
#define IPCC_C1MR_CH4OM_Msk           (0x1UL << IPCC_C1MR_CH4OM_Pos)           /*!< 0x00000008 */
#define IPCC_C1MR_CH4OM               IPCC_C1MR_CH4OM_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH5OM_Pos           (4U)
#define IPCC_C1MR_CH5OM_Msk           (0x1UL << IPCC_C1MR_CH5OM_Pos)           /*!< 0x00000010 */
#define IPCC_C1MR_CH5OM               IPCC_C1MR_CH5OM_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH6OM_Pos           (5U)
#define IPCC_C1MR_CH6OM_Msk           (0x1UL << IPCC_C1MR_CH6OM_Pos)           /*!< 0x00000020 */
#define IPCC_C1MR_CH6OM               IPCC_C1MR_CH6OM_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH7OM_Pos           (6U)
#define IPCC_C1MR_CH7OM_Msk           (0x1UL << IPCC_C1MR_CH7OM_Pos)           /*!< 0x00000040 */
#define IPCC_C1MR_CH7OM               IPCC_C1MR_CH7OM_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH8OM_Pos           (7U)
#define IPCC_C1MR_CH8OM_Msk           (0x1UL << IPCC_C1MR_CH8OM_Pos)           /*!< 0x00000080 */
#define IPCC_C1MR_CH8OM               IPCC_C1MR_CH8OM_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH9OM_Pos           (8U)
#define IPCC_C1MR_CH9OM_Msk           (0x1UL << IPCC_C1MR_CH9OM_Pos)           /*!< 0x00000100 */
#define IPCC_C1MR_CH9OM               IPCC_C1MR_CH9OM_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH10OM_Pos          (9U)
#define IPCC_C1MR_CH10OM_Msk          (0x1UL << IPCC_C1MR_CH10OM_Pos)          /*!< 0x00000200 */
#define IPCC_C1MR_CH10OM              IPCC_C1MR_CH10OM_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH11OM_Pos          (10U)
#define IPCC_C1MR_CH11OM_Msk          (0x1UL << IPCC_C1MR_CH11OM_Pos)          /*!< 0x00000400 */
#define IPCC_C1MR_CH11OM              IPCC_C1MR_CH11OM_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH12OM_Pos          (11U)
#define IPCC_C1MR_CH12OM_Msk          (0x1UL << IPCC_C1MR_CH12OM_Pos)          /*!< 0x00000800 */
#define IPCC_C1MR_CH12OM              IPCC_C1MR_CH12OM_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH13OM_Pos          (12U)
#define IPCC_C1MR_CH13OM_Msk          (0x1UL << IPCC_C1MR_CH13OM_Pos)          /*!< 0x00001000 */
#define IPCC_C1MR_CH13OM              IPCC_C1MR_CH13OM_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH14OM_Pos          (13U)
#define IPCC_C1MR_CH14OM_Msk          (0x1UL << IPCC_C1MR_CH14OM_Pos)          /*!< 0x00002000 */
#define IPCC_C1MR_CH14OM              IPCC_C1MR_CH14OM_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH15OM_Pos          (14U)
#define IPCC_C1MR_CH15OM_Msk          (0x1UL << IPCC_C1MR_CH15OM_Pos)          /*!< 0x00004000 */
#define IPCC_C1MR_CH15OM              IPCC_C1MR_CH15OM_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH16OM_Pos          (15U)
#define IPCC_C1MR_CH16OM_Msk          (0x1UL << IPCC_C1MR_CH16OM_Pos)          /*!< 0x00008000 */
#define IPCC_C1MR_CH16OM              IPCC_C1MR_CH16OM_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1MR_CH1FM_Pos           (16U)
#define IPCC_C1MR_CH1FM_Msk           (0x1UL << IPCC_C1MR_CH1FM_Pos)           /*!< 0x00010000 */
#define IPCC_C1MR_CH1FM               IPCC_C1MR_CH1FM_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH2FM_Pos           (17U)
#define IPCC_C1MR_CH2FM_Msk           (0x1UL << IPCC_C1MR_CH2FM_Pos)           /*!< 0x00020000 */
#define IPCC_C1MR_CH2FM               IPCC_C1MR_CH2FM_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH3FM_Pos           (18U)
#define IPCC_C1MR_CH3FM_Msk           (0x1UL << IPCC_C1MR_CH3FM_Pos)           /*!< 0x00040000 */
#define IPCC_C1MR_CH3FM               IPCC_C1MR_CH3FM_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH4FM_Pos           (19U)
#define IPCC_C1MR_CH4FM_Msk           (0x1UL << IPCC_C1MR_CH4FM_Pos)           /*!< 0x00080000 */
#define IPCC_C1MR_CH4FM               IPCC_C1MR_CH4FM_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH5FM_Pos           (20U)
#define IPCC_C1MR_CH5FM_Msk           (0x1UL << IPCC_C1MR_CH5FM_Pos)           /*!< 0x00100000 */
#define IPCC_C1MR_CH5FM               IPCC_C1MR_CH5FM_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH6FM_Pos           (21U)
#define IPCC_C1MR_CH6FM_Msk           (0x1UL << IPCC_C1MR_CH6FM_Pos)           /*!< 0x00200000 */
#define IPCC_C1MR_CH6FM               IPCC_C1MR_CH6FM_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH7FM_Pos           (22U)
#define IPCC_C1MR_CH7FM_Msk           (0x1UL << IPCC_C1MR_CH7FM_Pos)           /*!< 0x00400000 */
#define IPCC_C1MR_CH7FM               IPCC_C1MR_CH7FM_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH8FM_Pos           (23U)
#define IPCC_C1MR_CH8FM_Msk           (0x1UL << IPCC_C1MR_CH8FM_Pos)           /*!< 0x00800000 */
#define IPCC_C1MR_CH8FM               IPCC_C1MR_CH8FM_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH9FM_Pos           (24U)
#define IPCC_C1MR_CH9FM_Msk           (0x1UL << IPCC_C1MR_CH9FM_Pos)           /*!< 0x01000000 */
#define IPCC_C1MR_CH9FM               IPCC_C1MR_CH9FM_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH10FM_Pos          (25U)
#define IPCC_C1MR_CH10FM_Msk          (0x1UL << IPCC_C1MR_CH10FM_Pos)          /*!< 0x02000000 */
#define IPCC_C1MR_CH10FM              IPCC_C1MR_CH10FM_Msk                    /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH11FM_Pos          (26U)
#define IPCC_C1MR_CH11FM_Msk          (0x1UL << IPCC_C1MR_CH11FM_Pos)          /*!< 0x04000000 */
#define IPCC_C1MR_CH11FM              IPCC_C1MR_CH11FM_Msk                    /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH12FM_Pos          (27U)
#define IPCC_C1MR_CH12FM_Msk          (0x1UL << IPCC_C1MR_CH12FM_Pos)          /*!< 0x08000000 */
#define IPCC_C1MR_CH12FM              IPCC_C1MR_CH12FM_Msk                    /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH13FM_Pos          (28U)
#define IPCC_C1MR_CH13FM_Msk          (0x1UL << IPCC_C1MR_CH13FM_Pos)          /*!< 0x10000000 */
#define IPCC_C1MR_CH13FM              IPCC_C1MR_CH13FM_Msk                    /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH14FM_Pos          (29U)
#define IPCC_C1MR_CH14FM_Msk          (0x1UL << IPCC_C1MR_CH14FM_Pos)          /*!< 0x20000000 */
#define IPCC_C1MR_CH14FM              IPCC_C1MR_CH14FM_Msk                    /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH15FM_Pos          (30U)
#define IPCC_C1MR_CH15FM_Msk          (0x1UL << IPCC_C1MR_CH15FM_Pos)          /*!< 0x40000000 */
#define IPCC_C1MR_CH15FM              IPCC_C1MR_CH15FM_Msk                    /*!< Processor 1 transmit channel n status set */
#define IPCC_C1MR_CH16FM_Pos          (31U)
#define IPCC_C1MR_CH16FM_Msk          (0x1UL << IPCC_C1MR_CH16FM_Pos)          /*!< 0x80000000 */
#define IPCC_C1MR_CH16FM              IPCC_C1MR_CH16FM_Msk                    /*!< Processor 1 transmit channel n status set */

