STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235fxx_ca35.h
/* Bit fields for RCC_DCMIPPCFGR register */
#define RCC_DCMIPPCFGR_DCMIPPRST_Pos                 (0U)
#define RCC_DCMIPPCFGR_DCMIPPRST_Msk                 (0x1UL << RCC_DCMIPPCFGR_DCMIPPRST_Pos)                /*!< 0x00000001 */
#define RCC_DCMIPPCFGR_DCMIPPRST                     RCC_DCMIPPCFGR_DCMIPPRST_Msk                          /*!< DCMIPP reset */
#define RCC_DCMIPPCFGR_DCMIPPEN_Pos                  (1U)
#define RCC_DCMIPPCFGR_DCMIPPEN_Msk                  (0x1UL << RCC_DCMIPPCFGR_DCMIPPEN_Pos)                 /*!< 0x00000002 */
#define RCC_DCMIPPCFGR_DCMIPPEN                      RCC_DCMIPPCFGR_DCMIPPEN_Msk                           /*!< DCMIPP clock enable */
#define RCC_DCMIPPCFGR_DCMIPPLPEN_Pos                (2U)
#define RCC_DCMIPPCFGR_DCMIPPLPEN_Msk                (0x1UL << RCC_DCMIPPCFGR_DCMIPPLPEN_Pos)               /*!< 0x00000004 */
#define RCC_DCMIPPCFGR_DCMIPPLPEN                    RCC_DCMIPPCFGR_DCMIPPLPEN_Msk                         /*!< DCMIPP clock enable during CSleep  */

/* Bit fields for RCC_CCICFGR register */
#define RCC_CCICFGR_CCIRST_Pos                       (0U)
#define RCC_CCICFGR_CCIRST_Msk                       (0x1UL << RCC_CCICFGR_CCIRST_Pos)                      /*!< 0x00000001 */
#define RCC_CCICFGR_CCIRST                           RCC_CCICFGR_CCIRST_Msk                                /*!< CCI reset */
#define RCC_CCICFGR_CCIEN_Pos                        (1U)
#define RCC_CCICFGR_CCIEN_Msk                        (0x1UL << RCC_CCICFGR_CCIEN_Pos)                       /*!< 0x00000002 */
#define RCC_CCICFGR_CCIEN                            RCC_CCICFGR_CCIEN_Msk                                 /*!< CCI clock enable */
#define RCC_CCICFGR_CCILPEN_Pos                      (2U)
#define RCC_CCICFGR_CCILPEN_Msk                      (0x1UL << RCC_CCICFGR_CCILPEN_Pos)                     /*!< 0x00000004 */
#define RCC_CCICFGR_CCILPEN                          RCC_CCICFGR_CCILPEN_Msk                               /*!< CCI clock enable during CSleep  */

/* Bit fields for RCC_VDECCFGR register */
#define RCC_VDECCFGR_VDECRST_Pos                     (0U)
#define RCC_VDECCFGR_VDECRST_Msk                     (0x1UL << RCC_VDECCFGR_VDECRST_Pos)                    /*!< 0x00000001 */
#define RCC_VDECCFGR_VDECRST                         RCC_VDECCFGR_VDECRST_Msk                              /*!< VDEC reset */
#define RCC_VDECCFGR_VDECEN_Pos                      (1U)
#define RCC_VDECCFGR_VDECEN_Msk                      (0x1UL << RCC_VDECCFGR_VDECEN_Pos)                     /*!< 0x00000002 */
#define RCC_VDECCFGR_VDECEN                          RCC_VDECCFGR_VDECEN_Msk                               /*!< VDEC clock enable */
#define RCC_VDECCFGR_VDECLPEN_Pos                    (2U)
#define RCC_VDECCFGR_VDECLPEN_Msk                    (0x1UL << RCC_VDECCFGR_VDECLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_VDECCFGR_VDECLPEN                        RCC_VDECCFGR_VDECLPEN_Msk                             /*!< VDEC clock enable during CSleep  */

/* Bit fields for RCC_VENCCFGR register */
#define RCC_VENCCFGR_VENCRST_Pos                     (0U)
#define RCC_VENCCFGR_VENCRST_Msk                     (0x1UL << RCC_VENCCFGR_VENCRST_Pos)                    /*!< 0x00000001 */
#define RCC_VENCCFGR_VENCRST                         RCC_VENCCFGR_VENCRST_Msk                              /*!< VENC reset */
#define RCC_VENCCFGR_VENCEN_Pos                      (1U)
#define RCC_VENCCFGR_VENCEN_Msk                      (0x1UL << RCC_VENCCFGR_VENCEN_Pos)                     /*!< 0x00000002 */
#define RCC_VENCCFGR_VENCEN                          RCC_VENCCFGR_VENCEN_Msk                               /*!< VENC clock enable */
#define RCC_VENCCFGR_VENCLPEN_Pos                    (2U)
#define RCC_VENCCFGR_VENCLPEN_Msk                    (0x1UL << RCC_VENCCFGR_VENCLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_VENCCFGR_VENCLPEN                        RCC_VENCCFGR_VENCLPEN_Msk                             /*!< VENC clock enable during CSleep  */

/* Bit fields for RCC_RNGCFGR register */
#define RCC_RNGCFGR_RNGRST_Pos                       (0U)
#define RCC_RNGCFGR_RNGRST_Msk                       (0x1UL << RCC_RNGCFGR_RNGRST_Pos)                      /*!< 0x00000001 */
#define RCC_RNGCFGR_RNGRST                           RCC_RNGCFGR_RNGRST_Msk                                /*!< RNG reset */
#define RCC_RNGCFGR_RNGEN_Pos                        (1U)
#define RCC_RNGCFGR_RNGEN_Msk                        (0x1UL << RCC_RNGCFGR_RNGEN_Pos)                       /*!< 0x00000002 */
#define RCC_RNGCFGR_RNGEN                            RCC_RNGCFGR_RNGEN_Msk                                 /*!< RNG clock enable */
#define RCC_RNGCFGR_RNGLPEN_Pos                      (2U)
#define RCC_RNGCFGR_RNGLPEN_Msk                      (0x1UL << RCC_RNGCFGR_RNGLPEN_Pos)                     /*!< 0x00000004 */
#define RCC_RNGCFGR_RNGLPEN                          RCC_RNGCFGR_RNGLPEN_Msk                               /*!< RNG clock enable during CSleep  */

/* Bit fields for RCC_PKACFGR register */
#define RCC_PKACFGR_PKARST_Pos                       (0U)
#define RCC_PKACFGR_PKARST_Msk                       (0x1UL << RCC_PKACFGR_PKARST_Pos)                      /*!< 0x00000001 */
#define RCC_PKACFGR_PKARST                           RCC_PKACFGR_PKARST_Msk                                /*!< PKA reset */
#define RCC_PKACFGR_PKAEN_Pos                        (1U)
#define RCC_PKACFGR_PKAEN_Msk                        (0x1UL << RCC_PKACFGR_PKAEN_Pos)                       /*!< 0x00000002 */
#define RCC_PKACFGR_PKAEN                            RCC_PKACFGR_PKAEN_Msk                                 /*!< PKA clock enable */
#define RCC_PKACFGR_PKALPEN_Pos                      (2U)
#define RCC_PKACFGR_PKALPEN_Msk                      (0x1UL << RCC_PKACFGR_PKALPEN_Pos)                     /*!< 0x00000004 */
#define RCC_PKACFGR_PKALPEN                          RCC_PKACFGR_PKALPEN_Msk                               /*!< PKA clock enable during CSleep  */

/* Bit fields for RCC_SAESCFGR register */
#define RCC_SAESCFGR_SAESRST_Pos                     (0U)
#define RCC_SAESCFGR_SAESRST_Msk                     (0x1UL << RCC_SAESCFGR_SAESRST_Pos)                    /*!< 0x00000001 */
#define RCC_SAESCFGR_SAESRST                         RCC_SAESCFGR_SAESRST_Msk                              /*!< SAES reset */
#define RCC_SAESCFGR_SAESEN_Pos                      (1U)
#define RCC_SAESCFGR_SAESEN_Msk                      (0x1UL << RCC_SAESCFGR_SAESEN_Pos)                     /*!< 0x00000002 */
#define RCC_SAESCFGR_SAESEN                          RCC_SAESCFGR_SAESEN_Msk                               /*!< SAES clock enable */
#define RCC_SAESCFGR_SAESLPEN_Pos                    (2U)
#define RCC_SAESCFGR_SAESLPEN_Msk                    (0x1UL << RCC_SAESCFGR_SAESLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_SAESCFGR_SAESLPEN                        RCC_SAESCFGR_SAESLPEN_Msk                             /*!< SAES clock enable during CSleep  */

/* Bit fields for RCC_HASHCFGR register */
#define RCC_HASHCFGR_HASHRST_Pos                     (0U)
#define RCC_HASHCFGR_HASHRST_Msk                     (0x1UL << RCC_HASHCFGR_HASHRST_Pos)                    /*!< 0x00000001 */
#define RCC_HASHCFGR_HASHRST                         RCC_HASHCFGR_HASHRST_Msk                              /*!< HASH reset */
#define RCC_HASHCFGR_HASHEN_Pos                      (1U)
#define RCC_HASHCFGR_HASHEN_Msk                      (0x1UL << RCC_HASHCFGR_HASHEN_Pos)                     /*!< 0x00000002 */
#define RCC_HASHCFGR_HASHEN                          RCC_HASHCFGR_HASHEN_Msk                               /*!< HASH clock enable */
#define RCC_HASHCFGR_HASHLPEN_Pos                    (2U)
#define RCC_HASHCFGR_HASHLPEN_Msk                    (0x1UL << RCC_HASHCFGR_HASHLPEN_Pos)                   /*!< 0x00000004 */
#define RCC_HASHCFGR_HASHLPEN                        RCC_HASHCFGR_HASHLPEN_Msk                             /*!< HASH clock enable during CSleep  */

/* Bit fields for RCC_CRYP1CFGR register */
#define RCC_CRYP1CFGR_CRYP1RST_Pos                   (0U)
#define RCC_CRYP1CFGR_CRYP1RST_Msk                   (0x1UL << RCC_CRYP1CFGR_CRYP1RST_Pos)                  /*!< 0x00000001 */
#define RCC_CRYP1CFGR_CRYP1RST                       RCC_CRYP1CFGR_CRYP1RST_Msk                            /*!< CRYP1 reset */
#define RCC_CRYP1CFGR_CRYP1EN_Pos                    (1U)
#define RCC_CRYP1CFGR_CRYP1EN_Msk                    (0x1UL << RCC_CRYP1CFGR_CRYP1EN_Pos)                   /*!< 0x00000002 */
#define RCC_CRYP1CFGR_CRYP1EN                        RCC_CRYP1CFGR_CRYP1EN_Msk                             /*!< CRYP1 clock enable */
#define RCC_CRYP1CFGR_CRYP1LPEN_Pos                  (2U)
#define RCC_CRYP1CFGR_CRYP1LPEN_Msk                  (0x1UL << RCC_CRYP1CFGR_CRYP1LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_CRYP1CFGR_CRYP1LPEN                      RCC_CRYP1CFGR_CRYP1LPEN_Msk                           /*!< CRYP1 clock enable during CSleep  */

/* Bit fields for RCC_CRYP2CFGR register */
#define RCC_CRYP2CFGR_CRYP2RST_Pos                   (0U)
#define RCC_CRYP2CFGR_CRYP2RST_Msk                   (0x1UL << RCC_CRYP2CFGR_CRYP2RST_Pos)                  /*!< 0x00000001 */
#define RCC_CRYP2CFGR_CRYP2RST                       RCC_CRYP2CFGR_CRYP2RST_Msk                            /*!< CRYP2 reset */
#define RCC_CRYP2CFGR_CRYP2EN_Pos                    (1U)
#define RCC_CRYP2CFGR_CRYP2EN_Msk                    (0x1UL << RCC_CRYP2CFGR_CRYP2EN_Pos)                   /*!< 0x00000002 */
#define RCC_CRYP2CFGR_CRYP2EN                        RCC_CRYP2CFGR_CRYP2EN_Msk                             /*!< CRYP2 clock enable */
#define RCC_CRYP2CFGR_CRYP2LPEN_Pos                  (2U)
#define RCC_CRYP2CFGR_CRYP2LPEN_Msk                  (0x1UL << RCC_CRYP2CFGR_CRYP2LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_CRYP2CFGR_CRYP2LPEN                      RCC_CRYP2CFGR_CRYP2LPEN_Msk                           /*!< CRYP2 clock enable during CSleep  */

