STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235fxx_ca35.h
/*******************  Bits definition for IAC_ICR1 register *******************/
#define IAC_ICR1_IAF32_Pos            (0U)
#define IAC_ICR1_IAF32_Msk            (0x1UL << IAC_ICR1_IAF32_Pos)              /*!< 0x00000001 */
#define IAC_ICR1_IAF32                IAC_ICR1_IAF32_Msk
#define IAC_ICR1_IAF33_Pos            (1U)
#define IAC_ICR1_IAF33_Msk            (0x1UL << IAC_ICR1_IAF33_Pos)              /*!< 0x00000002 */
#define IAC_ICR1_IAF33                IAC_ICR1_IAF33_Msk
#define IAC_ICR1_IAF34_Pos            (2U)
#define IAC_ICR1_IAF34_Msk            (0x1UL << IAC_ICR1_IAF34_Pos)              /*!< 0x00000004 */
#define IAC_ICR1_IAF34                IAC_ICR1_IAF34_Msk
#define IAC_ICR1_IAF35_Pos            (3U)
#define IAC_ICR1_IAF35_Msk            (0x1UL << IAC_ICR1_IAF35_Pos)              /*!< 0x00000008 */
#define IAC_ICR1_IAF35                IAC_ICR1_IAF35_Msk
#define IAC_ICR1_IAF36_Pos            (4U)
#define IAC_ICR1_IAF36_Msk            (0x1UL << IAC_ICR1_IAF36_Pos)              /*!< 0x00000010 */
#define IAC_ICR1_IAF36                IAC_ICR1_IAF36_Msk
#define IAC_ICR1_IAF37_Pos            (5U)
#define IAC_ICR1_IAF37_Msk            (0x1UL << IAC_ICR1_IAF37_Pos)              /*!< 0x00000020 */
#define IAC_ICR1_IAF37                IAC_ICR1_IAF37_Msk
#define IAC_ICR1_IAF38_Pos            (6U)
#define IAC_ICR1_IAF38_Msk            (0x1UL << IAC_ICR1_IAF38_Pos)              /*!< 0x00000040 */
#define IAC_ICR1_IAF38                IAC_ICR1_IAF38_Msk
#define IAC_ICR1_IAF39_Pos            (7U)
#define IAC_ICR1_IAF39_Msk            (0x1UL << IAC_ICR1_IAF39_Pos)              /*!< 0x00000080 */
#define IAC_ICR1_IAF39                IAC_ICR1_IAF39_Msk
#define IAC_ICR1_IAF40_Pos            (8U)
#define IAC_ICR1_IAF40_Msk            (0x1UL << IAC_ICR1_IAF40_Pos)              /*!< 0x00000100 */
#define IAC_ICR1_IAF40                IAC_ICR1_IAF40_Msk
#define IAC_ICR1_IAF41_Pos            (9U)
#define IAC_ICR1_IAF41_Msk            (0x1UL << IAC_ICR1_IAF41_Pos)              /*!< 0x00000200 */
#define IAC_ICR1_IAF41                IAC_ICR1_IAF41_Msk
#define IAC_ICR1_IAF42_Pos            (10U)
#define IAC_ICR1_IAF42_Msk            (0x1UL << IAC_ICR1_IAF42_Pos)              /*!< 0x00000400 */
#define IAC_ICR1_IAF42                IAC_ICR1_IAF42_Msk
#define IAC_ICR1_IAF43_Pos            (11U)
#define IAC_ICR1_IAF43_Msk            (0x1UL << IAC_ICR1_IAF43_Pos)              /*!< 0x00000800 */
#define IAC_ICR1_IAF43                IAC_ICR1_IAF43_Msk
#define IAC_ICR1_IAF44_Pos            (12U)
#define IAC_ICR1_IAF44_Msk            (0x1UL << IAC_ICR1_IAF44_Pos)              /*!< 0x00001000 */
#define IAC_ICR1_IAF44                IAC_ICR1_IAF44_Msk
#define IAC_ICR1_IAF45_Pos            (13U)
#define IAC_ICR1_IAF45_Msk            (0x1UL << IAC_ICR1_IAF45_Pos)              /*!< 0x00002000 */
#define IAC_ICR1_IAF45                IAC_ICR1_IAF45_Msk
#define IAC_ICR1_IAF46_Pos            (14U)
#define IAC_ICR1_IAF46_Msk            (0x1UL << IAC_ICR1_IAF46_Pos)              /*!< 0x00004000 */
#define IAC_ICR1_IAF46                IAC_ICR1_IAF46_Msk
#define IAC_ICR1_IAF47_Pos            (15U)
#define IAC_ICR1_IAF47_Msk            (0x1UL << IAC_ICR1_IAF47_Pos)              /*!< 0x00008000 */
#define IAC_ICR1_IAF47                IAC_ICR1_IAF47_Msk
#define IAC_ICR1_IAF48_Pos            (16U)
#define IAC_ICR1_IAF48_Msk            (0x1UL << IAC_ICR1_IAF48_Pos)              /*!< 0x00010000 */
#define IAC_ICR1_IAF48                IAC_ICR1_IAF48_Msk
#define IAC_ICR1_IAF49_Pos            (17U)
#define IAC_ICR1_IAF49_Msk            (0x1UL << IAC_ICR1_IAF49_Pos)              /*!< 0x00020000 */
#define IAC_ICR1_IAF49                IAC_ICR1_IAF49_Msk
#define IAC_ICR1_IAF50_Pos            (18U)
#define IAC_ICR1_IAF50_Msk            (0x1UL << IAC_ICR1_IAF50_Pos)              /*!< 0x00040000 */
#define IAC_ICR1_IAF50                IAC_ICR1_IAF50_Msk
#define IAC_ICR1_IAF51_Pos            (19U)
#define IAC_ICR1_IAF51_Msk            (0x1UL << IAC_ICR1_IAF51_Pos)              /*!< 0x00080000 */
#define IAC_ICR1_IAF51                IAC_ICR1_IAF51_Msk
#define IAC_ICR1_IAF52_Pos            (20U)
#define IAC_ICR1_IAF52_Msk            (0x1UL << IAC_ICR1_IAF52_Pos)              /*!< 0x00100000 */
#define IAC_ICR1_IAF52                IAC_ICR1_IAF52_Msk
#define IAC_ICR1_IAF53_Pos            (21U)
#define IAC_ICR1_IAF53_Msk            (0x1UL << IAC_ICR1_IAF53_Pos)              /*!< 0x00200000 */
#define IAC_ICR1_IAF53                IAC_ICR1_IAF53_Msk
#define IAC_ICR1_IAF54_Pos            (22U)
#define IAC_ICR1_IAF54_Msk            (0x1UL << IAC_ICR1_IAF54_Pos)              /*!< 0x00400000 */
#define IAC_ICR1_IAF54                IAC_ICR1_IAF54_Msk
#define IAC_ICR1_IAF55_Pos            (23U)
#define IAC_ICR1_IAF55_Msk            (0x1UL << IAC_ICR1_IAF55_Pos)              /*!< 0x00800000 */
#define IAC_ICR1_IAF55                IAC_ICR1_IAF55_Msk
#define IAC_ICR1_IAF56_Pos            (24U)
#define IAC_ICR1_IAF56_Msk            (0x1UL << IAC_ICR1_IAF56_Pos)              /*!< 0x01000000 */
#define IAC_ICR1_IAF56                IAC_ICR1_IAF56_Msk
#define IAC_ICR1_IAF57_Pos            (25U)
#define IAC_ICR1_IAF57_Msk            (0x1UL << IAC_ICR1_IAF57_Pos)              /*!< 0x02000000 */
#define IAC_ICR1_IAF57                IAC_ICR1_IAF57_Msk
#define IAC_ICR1_IAF58_Pos            (26U)
#define IAC_ICR1_IAF58_Msk            (0x1UL << IAC_ICR1_IAF58_Pos)              /*!< 0x04000000 */
#define IAC_ICR1_IAF58                IAC_ICR1_IAF58_Msk
#define IAC_ICR1_IAF59_Pos            (27U)
#define IAC_ICR1_IAF59_Msk            (0x1UL << IAC_ICR1_IAF59_Pos)              /*!< 0x08000000 */
#define IAC_ICR1_IAF59                IAC_ICR1_IAF59_Msk
#define IAC_ICR1_IAF60_Pos            (28U)
#define IAC_ICR1_IAF60_Msk            (0x1UL << IAC_ICR1_IAF60_Pos)              /*!< 0x10000000 */
#define IAC_ICR1_IAF60                IAC_ICR1_IAF60_Msk
#define IAC_ICR1_IAF61_Pos            (29U)
#define IAC_ICR1_IAF61_Msk            (0x1UL << IAC_ICR1_IAF61_Pos)              /*!< 0x20000000 */
#define IAC_ICR1_IAF61                IAC_ICR1_IAF61_Msk
#define IAC_ICR1_IAF62_Pos            (30U)
#define IAC_ICR1_IAF62_Msk            (0x1UL << IAC_ICR1_IAF62_Pos)              /*!< 0x40000000 */
#define IAC_ICR1_IAF62                IAC_ICR1_IAF62_Msk
#define IAC_ICR1_IAF63_Pos            (31U)
#define IAC_ICR1_IAF63_Msk            (0x1UL << IAC_ICR1_IAF63_Pos)              /*!< 0x80000000 */
#define IAC_ICR1_IAF63                IAC_ICR1_IAF63_Msk

/*******************  Bits definition for IAC_ICR2 register *******************/
#define IAC_ICR2_IAF64_Pos            (0U)
#define IAC_ICR2_IAF64_Msk            (0x1UL << IAC_ICR2_IAF64_Pos)              /*!< 0x00000001 */
#define IAC_ICR2_IAF64                IAC_ICR2_IAF64_Msk
#define IAC_ICR2_IAF65_Pos            (1U)
#define IAC_ICR2_IAF65_Msk            (0x1UL << IAC_ICR2_IAF65_Pos)              /*!< 0x00000002 */
#define IAC_ICR2_IAF65                IAC_ICR2_IAF65_Msk
#define IAC_ICR2_IAF66_Pos            (2U)
#define IAC_ICR2_IAF66_Msk            (0x1UL << IAC_ICR2_IAF66_Pos)              /*!< 0x00000004 */
#define IAC_ICR2_IAF66                IAC_ICR2_IAF66_Msk
#define IAC_ICR2_IAF67_Pos            (3U)
#define IAC_ICR2_IAF67_Msk            (0x1UL << IAC_ICR2_IAF67_Pos)              /*!< 0x00000008 */
#define IAC_ICR2_IAF67                IAC_ICR2_IAF67_Msk
#define IAC_ICR2_IAF68_Pos            (4U)
#define IAC_ICR2_IAF68_Msk            (0x1UL << IAC_ICR2_IAF68_Pos)              /*!< 0x00000010 */
#define IAC_ICR2_IAF68                IAC_ICR2_IAF68_Msk
#define IAC_ICR2_IAF69_Pos            (5U)
#define IAC_ICR2_IAF69_Msk            (0x1UL << IAC_ICR2_IAF69_Pos)              /*!< 0x00000020 */
#define IAC_ICR2_IAF69                IAC_ICR2_IAF69_Msk
#define IAC_ICR2_IAF70_Pos            (6U)
#define IAC_ICR2_IAF70_Msk            (0x1UL << IAC_ICR2_IAF70_Pos)              /*!< 0x00000040 */
#define IAC_ICR2_IAF70                IAC_ICR2_IAF70_Msk
#define IAC_ICR2_IAF71_Pos            (7U)
#define IAC_ICR2_IAF71_Msk            (0x1UL << IAC_ICR2_IAF71_Pos)              /*!< 0x00000080 */
#define IAC_ICR2_IAF71                 IAC_ICR2_IAF71_Msk
#define IAC_ICR2_IAF72_Pos            (8U)
#define IAC_ICR2_IAF72_Msk            (0x1UL << IAC_ICR2_IAF72_Pos)              /*!< 0x00000100 */
#define IAC_ICR2_IAF72                IAC_ICR2_IAF72_Msk
#define IAC_ICR2_IAF73_Pos            (9U)
#define IAC_ICR2_IAF73_Msk            (0x1UL << IAC_ICR2_IAF73_Pos)              /*!< 0x00000200 */
#define IAC_ICR2_IAF73                IAC_ICR2_IAF73_Msk
#define IAC_ICR2_IAF74_Pos            (10U)
#define IAC_ICR2_IAF74_Msk            (0x1UL << IAC_ICR2_IAF74_Pos)              /*!< 0x00000400 */
#define IAC_ICR2_IAF74                IAC_ICR2_IAF74_Msk
#define IAC_ICR2_IAF75_Pos            (11U)
#define IAC_ICR2_IAF75_Msk            (0x1UL << IAC_ICR2_IAF75_Pos)              /*!< 0x00000800 */
#define IAC_ICR2_IAF75                IAC_ICR2_IAF75_Msk
#define IAC_ICR2_IAF76_Pos            (12U)
#define IAC_ICR2_IAF76_Msk            (0x1UL << IAC_ICR2_IAF76_Pos)              /*!< 0x00001000 */
#define IAC_ICR2_IAF76                IAC_ICR2_IAF76_Msk
#define IAC_ICR2_IAF77_Pos            (13U)
#define IAC_ICR2_IAF77_Msk            (0x1UL << IAC_ICR2_IAF77_Pos)              /*!< 0x00002000 */
#define IAC_ICR2_IAF77                IAC_ICR2_IAF77_Msk
#define IAC_ICR2_IAF78_Pos            (14U)
#define IAC_ICR2_IAF78_Msk            (0x1UL << IAC_ICR2_IAF78_Pos)              /*!< 0x00004000 */
#define IAC_ICR2_IAF78                IAC_ICR2_IAF78_Msk
#define IAC_ICR2_IAF79_Pos            (15U)
#define IAC_ICR2_IAF79_Msk            (0x1UL << IAC_ICR2_IAF79_Pos)              /*!< 0x00008000 */
#define IAC_ICR2_IAF79                IAC_ICR2_IAF79_Msk
#define IAC_ICR2_IAF80_Pos            (16U)
#define IAC_ICR2_IAF80_Msk            (0x1UL << IAC_ICR2_IAF80_Pos)              /*!< 0x00010000 */
#define IAC_ICR2_IAF80                IAC_ICR2_IAF80_Msk
#define IAC_ICR2_IAF81_Pos            (17U)
#define IAC_ICR2_IAF81_Msk            (0x1UL << IAC_ICR2_IAF81_Pos)              /*!< 0x00020000 */
#define IAC_ICR2_IAF81                IAC_ICR2_IAF81_Msk
#define IAC_ICR2_IAF82_Pos            (18U)
#define IAC_ICR2_IAF82_Msk            (0x1UL << IAC_ICR2_IAF82_Pos)              /*!< 0x00040000 */
#define IAC_ICR2_IAF82                IAC_ICR2_IAF82_Msk
#define IAC_ICR2_IAF83_Pos            (19U)
#define IAC_ICR2_IAF83_Msk            (0x1UL << IAC_ICR2_IAF83_Pos)              /*!< 0x00080000 */
#define IAC_ICR2_IAF83                IAC_ICR2_IAF83_Msk
#define IAC_ICR2_IAF84_Pos            (20U)
#define IAC_ICR2_IAF84_Msk            (0x1UL << IAC_ICR2_IAF84_Pos)              /*!< 0x00100000 */
#define IAC_ICR2_IAF84                IAC_ICR2_IAF84_Msk
#define IAC_ICR2_IAF85_Pos            (21U)
#define IAC_ICR2_IAF85_Msk            (0x1UL << IAC_ICR2_IAF85_Pos)              /*!< 0x00200000 */
#define IAC_ICR2_IAF85                IAC_ICR2_IAF85_Msk
#define IAC_ICR2_IAF86_Pos            (22U)
#define IAC_ICR2_IAF86_Msk            (0x1UL << IAC_ICR2_IAF86_Pos)              /*!< 0x00400000 */
#define IAC_ICR2_IAF86                IAC_ICR2_IAF86_Msk
#define IAC_ICR2_IAF87_Pos            (23U)
#define IAC_ICR2_IAF87_Msk            (0x1UL << IAC_ICR2_IAF87_Pos)              /*!< 0x00800000 */
#define IAC_ICR2_IAF87                IAC_ICR2_IAF87_Msk
#define IAC_ICR2_IAF88_Pos            (24U)
#define IAC_ICR2_IAF88_Msk            (0x1UL << IAC_ICR2_IAF88_Pos)              /*!< 0x01000000 */
#define IAC_ICR2_IAF88                IAC_ICR2_IAF88_Msk
#define IAC_ICR2_IAF89_Pos            (25U)
#define IAC_ICR2_IAF89_Msk            (0x1UL << IAC_ICR2_IAF89_Pos)              /*!< 0x02000000 */
#define IAC_ICR2_IAF89                IAC_ICR2_IAF89_Msk
#define IAC_ICR2_IAF90_Pos            (26U)
#define IAC_ICR2_IAF90_Msk            (0x1UL << IAC_ICR2_IAF90_Pos)              /*!< 0x04000000 */
#define IAC_ICR2_IAF90                IAC_ICR2_IAF90_Msk
#define IAC_ICR2_IAF91_Pos            (27U)
#define IAC_ICR2_IAF91_Msk            (0x1UL << IAC_ICR2_IAF91_Pos)              /*!< 0x08000000 */
#define IAC_ICR2_IAF91                IAC_ICR2_IAF91_Msk
#define IAC_ICR2_IAF92_Pos            (28U)
#define IAC_ICR2_IAF92_Msk            (0x1UL << IAC_ICR2_IAF92_Pos)              /*!< 0x10000000 */
#define IAC_ICR2_IAF92                IAC_ICR2_IAF92_Msk
#define IAC_ICR2_IAF93_Pos            (29U)
#define IAC_ICR2_IAF93_Msk            (0x1UL << IAC_ICR2_IAF93_Pos)              /*!< 0x20000000 */
#define IAC_ICR2_IAF93                IAC_ICR2_IAF93_Msk
#define IAC_ICR2_IAF94_Pos            (30U)
#define IAC_ICR2_IAF94_Msk            (0x1UL << IAC_ICR2_IAF94_Pos)              /*!< 0x40000000 */
#define IAC_ICR2_IAF94                IAC_ICR2_IAF94_Msk
#define IAC_ICR2_IAF95_Pos            (31U)
#define IAC_ICR2_IAF95_Msk            (0x1UL << IAC_ICR2_IAF95_Pos)              /*!< 0x80000000 */
#define IAC_ICR2_IAF95                IAC_ICR2_IAF95_Msk

/*******************  Bits definition for IAC_ICR3 register *******************/
#define IAC_ICR3_IAF96_Pos            (0U)
#define IAC_ICR3_IAF96_Msk            (0x1UL << IAC_ICR3_IAF96_Pos)              /*!< 0x00000001 */
#define IAC_ICR3_IAF96                IAC_ICR3_IAF96_Msk
#define IAC_ICR3_IAF97_Pos            (1U)
#define IAC_ICR3_IAF97_Msk            (0x1UL << IAC_ICR3_IAF97_Pos)              /*!< 0x00000002 */
#define IAC_ICR3_IAF97                IAC_ICR3_IAF97_Msk
#define IAC_ICR3_IAF98_Pos            (2U)
#define IAC_ICR3_IAF98_Msk            (0x1UL << IAC_ICR3_IAF98_Pos)              /*!< 0x00000004 */
#define IAC_ICR3_IAF98                IAC_ICR3_IAF98_Msk
#define IAC_ICR3_IAF99_Pos            (3U)
#define IAC_ICR3_IAF99_Msk            (0x1UL << IAC_ICR3_IAF99_Pos)              /*!< 0x00000008 */
#define IAC_ICR3_IAF99                IAC_ICR3_IAF99_Msk
#define IAC_ICR3_IAF100_Pos           (4U)
#define IAC_ICR3_IAF100_Msk           (0x1UL << IAC_ICR3_IAF100_Pos)             /*!< 0x00000010 */
#define IAC_ICR3_IAF100               IAC_ICR3_IAF100_Msk
#define IAC_ICR3_IAF101_Pos           (5U)
#define IAC_ICR3_IAF101_Msk           (0x1UL << IAC_ICR3_IAF101_Pos)             /*!< 0x00000020 */
#define IAC_ICR3_IAF101               IAC_ICR3_IAF101_Msk
#define IAC_ICR3_IAF102_Pos           (6U)
#define IAC_ICR3_IAF102_Msk           (0x1UL << IAC_ICR3_IAF102_Pos)             /*!< 0x00000040 */
#define IAC_ICR3_IAF102               IAC_ICR3_IAF102_Msk
#define IAC_ICR3_IAF103_Pos           (7U)
#define IAC_ICR3_IAF103_Msk           (0x1UL << IAC_ICR3_IAF103_Pos)             /*!< 0x00000080 */
#define IAC_ICR3_IAF103               IAC_ICR3_IAF103_Msk
#define IAC_ICR3_IAF104_Pos           (8U)
#define IAC_ICR3_IAF104_Msk           (0x1UL << IAC_ICR3_IAF104_Pos)             /*!< 0x00000100 */
#define IAC_ICR3_IAF104               IAC_ICR3_IAF104_Msk
#define IAC_ICR3_IAF105_Pos           (9U)
#define IAC_ICR3_IAF105_Msk           (0x1UL << IAC_ICR3_IAF105_Pos)             /*!< 0x00000200 */
#define IAC_ICR3_IAF105               IAC_ICR3_IAF105_Msk
#define IAC_ICR3_IAF106_Pos           (10U)
#define IAC_ICR3_IAF106_Msk           (0x1UL << IAC_ICR3_IAF106_Pos)             /*!< 0x00000400 */
#define IAC_ICR3_IAF106               IAC_ICR3_IAF106_Msk
#define IAC_ICR3_IAF107_Pos           (11U)
#define IAC_ICR3_IAF107_Msk           (0x1UL << IAC_ICR3_IAF107_Pos)             /*!< 0x00000800 */
#define IAC_ICR3_IAF107               IAC_ICR3_IAF107_Msk
#define IAC_ICR3_IAF108_Pos           (12U)
#define IAC_ICR3_IAF108_Msk           (0x1UL << IAC_ICR3_IAF108_Pos)             /*!< 0x00001000 */
#define IAC_ICR3_IAF108               IAC_ICR3_IAF108_Msk
#define IAC_ICR3_IAF109_Pos           (13U)
#define IAC_ICR3_IAF109_Msk           (0x1UL << IAC_ICR3_IAF109_Pos)             /*!< 0x00002000 */
#define IAC_ICR3_IAF109               IAC_ICR3_IAF109_Msk
#define IAC_ICR3_IAF110_Pos           (14U)
#define IAC_ICR3_IAF110_Msk           (0x1UL << IAC_ICR3_IAF110_Pos)             /*!< 0x00004000 */
#define IAC_ICR3_IAF110               IAC_ICR3_IAF110_Msk
#define IAC_ICR3_IAF111_Pos           (15U)
#define IAC_ICR3_IAF111_Msk           (0x1UL << IAC_ICR3_IAF111_Pos)             /*!< 0x00008000 */
#define IAC_ICR3_IAF111               IAC_ICR3_IAF111_Msk
#define IAC_ICR3_IAF112_Pos           (16U)
#define IAC_ICR3_IAF112_Msk           (0x1UL << IAC_ICR3_IAF112_Pos)             /*!< 0x00010000 */
#define IAC_ICR3_IAF112               IAC_ICR3_IAF112_Msk
#define IAC_ICR3_IAF113_Pos           (17U)
#define IAC_ICR3_IAF113_Msk           (0x1UL << IAC_ICR3_IAF113_Pos)             /*!< 0x00020000 */
#define IAC_ICR3_IAF113               IAC_ICR3_IAF113_Msk
#define IAC_ICR3_IAF114_Pos           (18U)
#define IAC_ICR3_IAF114_Msk           (0x1UL << IAC_ICR3_IAF114_Pos)             /*!< 0x00040000 */
#define IAC_ICR3_IAF114               IAC_ICR3_IAF114_Msk
#define IAC_ICR3_IAF115_Pos           (19U)
#define IAC_ICR3_IAF115_Msk           (0x1UL << IAC_ICR3_IAF115_Pos)             /*!< 0x00080000 */
#define IAC_ICR3_IAF115               IAC_ICR3_IAF115_Msk
#define IAC_ICR3_IAF116_Pos           (20U)
#define IAC_ICR3_IAF116_Msk           (0x1UL << IAC_ICR3_IAF116_Pos)             /*!< 0x00100000 */
#define IAC_ICR3_IAF116               IAC_ICR3_IAF116_Msk
#define IAC_ICR3_IAF117_Pos           (21U)
#define IAC_ICR3_IAF117_Msk           (0x1UL << IAC_ICR3_IAF117_Pos)             /*!< 0x00200000 */
#define IAC_ICR3_IAF117               IAC_ICR3_IAF117_Msk
#define IAC_ICR3_IAF118_Pos           (22U)
#define IAC_ICR3_IAF118_Msk           (0x1UL << IAC_ICR3_IAF118_Pos)             /*!< 0x00400000 */
#define IAC_ICR3_IAF118               IAC_ICR3_IAF118_Msk
#define IAC_ICR3_IAF119_Pos           (23U)
#define IAC_ICR3_IAF119_Msk           (0x1UL << IAC_ICR3_IAF119_Pos)             /*!< 0x00800000 */
#define IAC_ICR3_IAF119               IAC_ICR3_IAF119_Msk
#define IAC_ICR3_IAF120_Pos           (24U)
#define IAC_ICR3_IAF120_Msk           (0x1UL << IAC_ICR3_IAF120_Pos)             /*!< 0x01000000 */
#define IAC_ICR3_IAF120               IAC_ICR3_IAF120_Msk
#define IAC_ICR3_IAF121_Pos           (25U)
#define IAC_ICR3_IAF121_Msk           (0x1UL << IAC_ICR3_IAF121_Pos)             /*!< 0x02000000 */
#define IAC_ICR3_IAF121               IAC_ICR3_IAF121_Msk
#define IAC_ICR3_IAF122_Pos           (26U)
#define IAC_ICR3_IAF122_Msk           (0x1UL << IAC_ICR3_IAF122_Pos)             /*!< 0x04000000 */
#define IAC_ICR3_IAF122               IAC_ICR3_IAF122_Msk
#define IAC_ICR3_IAF123_Pos           (27U)
#define IAC_ICR3_IAF123_Msk           (0x1UL << IAC_ICR3_IAF123_Pos)             /*!< 0x08000000 */
#define IAC_ICR3_IAF123               IAC_ICR3_IAF123_Msk
#define IAC_ICR3_IAF124_Pos           (28U)
#define IAC_ICR3_IAF124_Msk           (0x1UL << IAC_ICR3_IAF124_Pos)             /*!< 0x10000000 */
#define IAC_ICR3_IAF124               IAC_ICR3_IAF124_Msk
#define IAC_ICR3_IAF125_Pos           (29U)
#define IAC_ICR3_IAF125_Msk           (0x1UL << IAC_ICR3_IAF125_Pos)             /*!< 0x20000000 */
#define IAC_ICR3_IAF125               IAC_ICR3_IAF125_Msk
#define IAC_ICR3_IAF126_Pos           (30U)
#define IAC_ICR3_IAF126_Msk           (0x1UL << IAC_ICR3_IAF126_Pos)             /*!< 0x40000000 */
#define IAC_ICR3_IAF126               IAC_ICR3_IAF126_Msk
#define IAC_ICR3_IAF127_Pos           (31U)
#define IAC_ICR3_IAF127_Msk           (0x1UL << IAC_ICR3_IAF127_Pos)             /*!< 0x80000000 */
#define IAC_ICR3_IAF127               IAC_ICR3_IAF127_Msk

